//#pragma once
#ifndef NTDLL_H
#define NTDLL_H

// ntdll.h  10/14/2011

#include <windows.h>

#ifdef _MSC_VER
# pragma warning(disable:4005) // C4005: macro redefinition
# pragma warning(disable:4200) // C4200: nonstandard extension used : zero-sized array in struct/union
# pragma warning(disable:4010) // C4010: single-line comment contains line-continuation character
# pragma warning(disable:4996) // C4996: unsafe function or variable used such as swprintf, wcscpy; alternatively use __CRT_SECURE_NO_WARNINGS
#endif // _MSC_VER

#define NT_INCLUDED
#define _NTDEF_
#define _CTYPE_DISABLE_MACROS

// Remove official macros from WSDK
#undef STATUS_WAIT_0
#undef STATUS_ABANDONED_WAIT_0
#undef STATUS_USER_APC
#undef STATUS_TIMEOUT
#undef STATUS_PENDING
#undef DBG_CONTINUE
#undef STATUS_SEGMENT_NOTIFICATION
#undef DBG_TERMINATE_THREAD
#undef DBG_TERMINATE_PROCESS
#undef DBG_CONTROL_C
#undef DBG_CONTROL_BREAK
#undef STATUS_GUARD_PAGE_VIOLATION
#undef STATUS_DATATYPE_MISALIGNMENT
#undef STATUS_BREAKPOINT
#undef STATUS_SINGLE_STEP
#undef DBG_EXCEPTION_NOT_HANDLED
#undef STATUS_ACCESS_VIOLATION
#undef STATUS_IN_PAGE_ERROR
#undef STATUS_INVALID_HANDLE
#undef STATUS_NO_MEMORY
#undef STATUS_ILLEGAL_INSTRUCTION
#undef STATUS_NONCONTINUABLE_EXCEPTION
#undef STATUS_INVALID_DISPOSITION
#undef STATUS_ARRAY_BOUNDS_EXCEEDED
#undef STATUS_FLOAT_DENORMAL_OPERAND
#undef STATUS_FLOAT_DIVIDE_BY_ZERO
#undef STATUS_FLOAT_INEXACT_RESULT
#undef STATUS_FLOAT_INVALID_OPERATION
#undef STATUS_FLOAT_OVERFLOW

// Object Manager Directory Specific Access Rights.
#define DIRECTORY_QUERY                 0x0001
#define DIRECTORY_TRAVERSE              0x0002
#define DIRECTORY_CREATE_OBJECT         0x0004
#define DIRECTORY_CREATE_SUBDIRECTORY   0x0008
#define DIRECTORY_ALL_ACCESS            (STANDARD_RIGHTS_REQUIRED | 0xF)

// Object Manager Symbolic Link Specific Access Rights.
#define SYMBOLIC_LINK_QUERY         0x0001
#define SYMBOLIC_LINK_ALL_ACCESS    (STANDARD_RIGHTS_REQUIRED | 0x1)

#define NT_SUCCESS(Status)          ((LONG)(Status) >= 0)
#define NT_ERROR(Status)            ((ULONG)(Status) >> 30 == 3)

#define DEVICE_TYPE     DWORD

// Values for RtlAdjustPrivilege
#define SE_MIN_WELL_KNOWN_PRIVILEGE       (2L)
#define SE_CREATE_TOKEN_PRIVILEGE         (2L)
#define SE_ASSIGNPRIMARYTOKEN_PRIVILEGE   (3L)
#define SE_LOCK_MEMORY_PRIVILEGE          (4L)
#define SE_INCREASE_QUOTA_PRIVILEGE       (5L)
#define SE_UNSOLICITED_INPUT_PRIVILEGE    (6L) // obsolete and unused
#define SE_MACHINE_ACCOUNT_PRIVILEGE      (6L)
#define SE_TCB_PRIVILEGE                  (7L)
#define SE_SECURITY_PRIVILEGE             (8L)
#define SE_TAKE_OWNERSHIP_PRIVILEGE       (9L)
#define SE_LOAD_DRIVER_PRIVILEGE          (10L)
#define SE_PROFILE_PRIVILEGE              (11L)
#define SE_SYSTEMTIME_PRIVILEGE           (12L)
#define SE_PROF_SINGLE_PROCESS_PRIVILEGE  (13L)
#define SE_INC_BASE_PRIORITY_PRIVILEGE    (14L)
#define SE_CREATE_PAGEFILE_PRIVILEGE      (15L)
#define SE_CREATE_PERMANENT_PRIVILEGE     (16L)
#define SE_BACKUP_PRIVILEGE               (17L)
#define SE_RESTORE_PRIVILEGE              (18L)
#define SE_SHUTDOWN_PRIVILEGE             (19L)
#define SE_DEBUG_PRIVILEGE                (20L)
#define SE_AUDIT_PRIVILEGE                (21L)
#define SE_SYSTEM_ENVIRONMENT_PRIVILEGE   (22L)
#define SE_CHANGE_NOTIFY_PRIVILEGE        (23L)
#define SE_REMOTE_SHUTDOWN_PRIVILEGE      (24L)
#define SE_MAX_WELL_KNOWN_PRIVILEGE       (SE_REMOTE_SHUTDOWN_PRIVILEGE)

#define VdmDirectoryFile 6

#define InitializeObjectAttributes( p, n, a, r, s ) {   \
  (p)->uLength = sizeof( OBJECT_ATTRIBUTES );           \
  (p)->hRootDirectory = r;                              \
  (p)->uAttributes = a;                                 \
  (p)->pObjectName = n;                                 \
  (p)->pSecurityDescriptor = s;                         \
  (p)->pSecurityQualityOfService = NULL;                \
}

// - Basic Types -

typedef LONG        NTSTATUS;
//lint -e624        // Don't complain about different typedefs.
//
typedef NTSTATUS    *PNTSTATUS;
//lint +e624        // Resume checking for different typedefs.

typedef NTSTATUS    (NTAPI *NTSYSCALL)();
typedef NTSYSCALL   *PNTSYSCALL;

typedef ULONG       KAFFINITY;
typedef KAFFINITY   *PKAFFINITY;
typedef LONG        KPRIORITY;

typedef BYTE        KPROCESSOR_MODE;

// - Structures -

typedef VOID *POBJECT;
typedef VOID (*PKNORMAL_ROUTINE) (
 __in  PVOID    NormalContext,
 __in  PVOID    SystemArgument1,
 __in  PVOID    SystemArgument2
);

typedef struct _STRING
{
  USHORT Length;
  USHORT MaximumLength;
#ifdef MIDL_PASS
  [ size_is(MaximumLength), length_is(Length) ]
#endif // MIDL_PASS
  PCHAR Buffer;
} STRING, *PSTRING;

typedef STRING ANSI_STRING;
typedef PSTRING PANSI_STRING;

typedef STRING OEM_STRING;
typedef PSTRING POEM_STRING;


typedef struct _UNICODE_STRING
{
  USHORT Length;
  USHORT MaximumLength;
  PWSTR  Buffer;
} UNICODE_STRING, *PUNICODE_STRING;

// - APIs -

NTSYSAPI
NTSTATUS
NTAPI
RtlUnicodeStringToAnsiString(
  PANSI_STRING DestinationString,
  PUNICODE_STRING SourceString,
  BOOLEAN AllocateDestinationString
);

typedef struct _HARDWARE_PTE
{
  ULONG Valid             : 1;
  ULONG Write             : 1;
  ULONG Owner             : 1;
  ULONG WriteThrough      : 1;
  ULONG CacheDisable      : 1;
  ULONG Accessed          : 1;
  ULONG Dirty             : 1;
  ULONG LargePage         : 1;
  ULONG Global            : 1;
  ULONG CopyOnWrite       : 1;
  ULONG Prototype         : 1;
  ULONG reserved          : 1;
  ULONG PageFrameNumber   : 20;
} HARDWARE_PTE, *PHARDWARE_PTE;

typedef struct _OBJECT_ATTRIBUTES
{
  ULONG             uLength;
  HANDLE            hRootDirectory;
  PUNICODE_STRING   pObjectName;
  ULONG             uAttributes;
  PVOID             pSecurityDescriptor;
  PVOID             pSecurityQualityOfService;
} OBJECT_ATTRIBUTES, *POBJECT_ATTRIBUTES;

typedef struct _CLIENT_ID
{
  DWORD  UniqueProcess;
  DWORD  UniqueThread;
} CLIENT_ID, *PCLIENT_ID;

typedef struct _PEB_FREE_BLOCK
{
  struct    _PEB_FREE_BLOCK  *Next;
  ULONG     Size;
} PEB_FREE_BLOCK, *PPEB_FREE_BLOCK;

typedef struct _CURDIR
{
  UNICODE_STRING    DosPath;
  HANDLE            Handle;
} CURDIR, *PCURDIR;

typedef struct _RTL_DRIVE_LETTER_CURDIR
{
  WORD      Flags;
  WORD      Length;
  DWORD     TimeStamp;
  STRING    DosPath;
} RTL_DRIVE_LETTER_CURDIR, *PRTL_DRIVE_LETTER_CURDIR;

#define  PROCESS_PARAMETERS_NORMALIZED  1  // pointers in are absolute (not self-relative)

typedef struct _PROCESS_PARAMETERS
{
  ULONG             MaximumLength;
  ULONG             Length;
  ULONG             Flags;  // PROCESS_PARAMETERS_NORMALIZED
  ULONG             DebugFlags;
  HANDLE            ConsoleHandle;
  ULONG             ConsoleFlags;
  HANDLE            StandardInput;
  HANDLE            StandardOutput;
  HANDLE            StandardError;
  CURDIR            CurrentDirectory;
  UNICODE_STRING    DllPath;
  UNICODE_STRING    ImagePathName;
  UNICODE_STRING    CommandLine;
  PWSTR             Environment;
  ULONG             StartingX;
  ULONG             StartingY;
  ULONG             CountX;
  ULONG             CountY;
  ULONG             ountCharsX;
  ULONG             CountCharsY;
  ULONG             FillAttribute;
  ULONG             WindowFlags;
  ULONG             ShowWindowFlags;
  UNICODE_STRING    WindowTitle;
  UNICODE_STRING    Desktop;
  UNICODE_STRING    ShellInfo;
  UNICODE_STRING    RuntimeInfo;
  RTL_DRIVE_LETTER_CURDIR  CurrentDirectores[32];
} PROCESS_PARAMETERS, *PPROCESS_PARAMETERS;

typedef struct _RTL_BITMAP
{
  DWORD  SizeOfBitMap;
  PDWORD  Buffer;
} RTL_BITMAP, *PRTL_BITMAP, **PPRTL_BITMAP;

#define LDR_STATIC_LINK             0x0000002
#define LDR_IMAGE_DLL               0x0000004
#define LDR_LOAD_IN_PROGRESS        0x0001000
#define LDR_UNLOAD_IN_PROGRESS      0x0002000
#define LDR_ENTRY_PROCESSED         0x0004000
#define LDR_ENTRY_INSERTED          0x0008000
#define LDR_CURRENT_LOAD            0x0010000
#define LDR_FAILED_BUILTIN_LOAD     0x0020000
#define LDR_DONT_CALL_FOR_THREADS   0x0040000
#define LDR_PROCESS_ATTACH_CALLED   0x0080000
#define LDR_DEBUG_SYMBOLS_LOADED    0x0100000
#define LDR_IMAGE_NOT_AT_BASE       0x0200000
#define LDR_WX86_IGNORE_MACHINETYPE 0x0400000

typedef struct _LDR_DATA_TABLE_ENTRY
{
  LIST_ENTRY        InLoadOrderModuleList;
  LIST_ENTRY        InMemoryOrderModuleList;
  LIST_ENTRY        InInitializationOrderModuleList;
  PVOID             DllBase;
  PVOID             EntryPoint;
  ULONG             SizeOfImage;  // in bytes
  UNICODE_STRING    FullDllName;
  UNICODE_STRING    BaseDllName;
  ULONG             Flags;      // LDR_*
  USHORT            LoadCount;
  USHORT            TlsIndex;
  LIST_ENTRY        HashLinks;
  PVOID             SectionPointer;
  ULONG             CheckSum;
  ULONG             TimeDateStamp;
//PVOID             LoadedImports; // seems they are exist only on XP !!!
//PVOID             EntryPointActivationContext;  // the same as above
} LDR_DATA_TABLE_ENTRY, *PLDR_DATA_TABLE_ENTRY;

// See: http://en.wikipedia.org/wiki/Process_Environment_Block
typedef struct _PEB_LDR_DATA
{
  ULONG       Length;       // 0
  BOOLEAN     Initialized;  // 4
  PVOID       SsHandle;     // 8?
  LIST_ENTRY  InLoadOrderModuleList;            // C, ref. to PLDR_DATA_TABLE_ENTRY->InLoadOrderModuleList
  LIST_ENTRY  InMemoryOrderModuleList;          // 14, ref. to PLDR_DATA_TABLE_ENTRY->InMemoryOrderModuleList
  LIST_ENTRY  InInitializationOrderModuleList;  // 1C, ref. to PLDR_DATA_TABLE_ENTRY->InInitializationOrderModuleList
} PEB_LDR_DATA, *PPEB_LDR_DATA;

typedef VOID NTSYSAPI (*PPEBLOCKROUTINE)(PVOID);

typedef struct _SYSTEM_STRINGS
{
  UNICODE_STRING SystemRoot;       // C:\WINNT
  UNICODE_STRING System32Root;     // C:\WINNT\System32
  UNICODE_STRING BaseNamedObjects; // \BaseNamedObjects
} SYSTEM_STRINGS,*PSYSTEM_STRINGS;

typedef struct _TEXT_INFO
{
  PVOID           Reserved;
  PSYSTEM_STRINGS SystemStrings;
} TEXT_INFO, *PTEXT_INFO;

// See: http://en.wikipedia.org/wiki/Process_Environment_Block
typedef struct _PEB
{
  UCHAR         InheritedAddressSpace;          // 0
  UCHAR         ReadImageFileExecOptions;       // 1
  UCHAR         BeingDebugged;                  // 2
  BYTE          b003;                           // 3
  PVOID         Mutant;                         // 4
  PVOID         ImageBaseAddress;               // 8
  PPEB_LDR_DATA         Ldr;                    // C
  PPROCESS_PARAMETERS   ProcessParameters;      // 10
  PVOID        SubSystemData;                   // 14
  PVOID        ProcessHeap;                     // 18
  KSPIN_LOCK            FastPebLock;            // 1C
  PPEBLOCKROUTINE       FastPebLockRoutine;     // 20
  PPEBLOCKROUTINE       FastPebUnlockRoutine;   // 24
  ULONG        EnvironmentUpdateCount;          // 28
  PVOID       *KernelCallbackTable;             // 2C
  PVOID        EventLogSection;                 // 30
  PVOID        EventLog;                        // 34
  PPEB_FREE_BLOCK    FreeList;                  // 38
  ULONG        TlsExpansionCounter;             // 3C
  PRTL_BITMAP  TlsBitmap;                       // 40
  ULONG        TlsBitmapData[0x2];              // 44
  PVOID        ReadOnlySharedMemoryBase;        // 4C
  PVOID        ReadOnlySharedMemoryHeap;        // 50
  PTEXT_INFO   ReadOnlyStaticServerData;        // 54
  PVOID        InitAnsiCodePageData;            // 58
  PVOID        InitOemCodePageData;             // 5C
  PVOID        InitUnicodeCaseTableData;        // 60
  ULONG        KeNumberProcessors;              // 64
  ULONG        NtGlobalFlag;                    // 68
  DWORD        d6C;                             // 6C
  LARGE_INTEGER MmCriticalSectionTimeout;       // 70
  ULONG        MmHeapSegmentReserve;            // 78
  ULONG        MmHeapSegmentCommit;             // 7C
  ULONG        MmHeapDeCommitTotalFreeThreshold; // 80
  ULONG        MmHeapDeCommitFreeBlockThreshold; // 84
  ULONG        NumberOfHeaps;                   // 88
  ULONG        AvailableHeaps;                  // 8C
  PHANDLE      ProcessHeapsListBuffer;          // 90
  PVOID        GdiSharedHandleTable;            // 94
  PVOID        ProcessStarterHelper;            // 98
  PVOID        GdiDCAttributeList;              // 9C
  KSPIN_LOCK   LoaderLock;                      // A0
  ULONG        NtMajorVersion;                  // A4
  ULONG        NtMinorVersion;                  // A8
  USHORT       NtBuildNumber;                   // AC
  USHORT       NtCSDVersion;                    // AE
  ULONG        PlatformId;                      // B0
  ULONG        Subsystem;                       // B4
  ULONG        MajorSubsystemVersion;           // B8
  ULONG        MinorSubsystemVersion;           // BC
  KAFFINITY    AffinityMask;                    // C0
  ULONG        GdiHandleBuffer[0x22];           // C4
  ULONG        PostProcessInitRoutine;          // 14C
  ULONG        TlsExpansionBitmap;              // 150
  UCHAR        TlsExpansionBitmapBits[0x80];    // 154
  ULONG        SessionId;                       // 1D4
  ULARGE_INTEGER    AppCompatFlags;             // 1D8
  PWORD        CSDVersion;                      // 1E0
/*  PVOID        AppCompatInfo;                 // 1E4
  UNICODE_STRING    usCSDVersion;
  PVOID        ActivationContextData;
  PVOID        ProcessAssemblyStorageMap;
  PVOID        SystemDefaultActivationContextData;
  PVOID        SystemAssemblyStorageMap;
  ULONG        MinimumStackCommit; */
} PEB, *PPEB;

typedef struct _PEB64 {
  BYTE          Reserved1[2];
  BYTE          BeingDebugged;
  BYTE          Reserved2[21];
  PPEB_LDR_DATA Ldr;
  PPROCESS_PARAMETERS   ProcessParameters;
  BYTE          Reserved3[520];
  ULONG         PostProcessInitRoutine;
  BYTE          Reserved4[136];
  ULONG         SessionId;
} PEB64;

typedef struct _TEB
{
  NT_TIB        Tib;
  PVOID         EnvironmentPointer;
  CLIENT_ID     Cid;
  PVOID         ActiveRpcInfo;
  PVOID         ThreadLocalStoragePointer;
  PPEB          Peb;
  ULONG         LastErrorValue;
  ULONG         CountOfOwnedCriticalSections;
  PVOID         CsrClientThread;
